{
    "projects": [
        {
            "id": 0,
            "project_name": "Public API Requests",
            "description": "Pulls 12 random personas from a third party API to dynamically display an employee directory.",
            "info": [
                "Enhanced front-end development skills, particularly in working with APIs, asynchronous programming, and dynamic DOM manipulation.",
                "Learned to fetch data from the Random User Generator API using fetch, process and render this data dynamically into the DOM.",
                "Created interactive elements such as employee cards and modal windows.",
                "Improved ability to handle user interactions and events.",
                "Managed asynchronous operations with async and await.",
                "Ensured a smooth user experience by handling potential errors gracefully.",
                "Provided a comprehensive understanding of integrating public APIs and creating responsive, data-driven web interfaces."
            ],
            "technologies": [
                "JavaScript",
                "HTML",
                "CSS",
                "JSON",
                "API"
            ],
            "live_link": "https://erin-ramos.github.io/Project5-PublicAPIRequests/",
            "github_link": "https://github.com/Erin-Ramos/Project5-PublicAPIRequests",
            "image_urls": [
                "/static/images/4-0.png",
                "/static/images/4-1.png"
            ]
        },
        {
            "id": 1,
            "project_name": "SQL Library Manager",
            "description": "A web application for listing, adding, updating, and deleting books in a library.",
            "info": [
                "Improved skills in full-stack web development, particularly with Express.js and Sequelize.",
                "Learned how to set up an Express application with Pug as the templating engine.",
                "Managed routes for CRUD operations.",
                "Handled middleware for logging, parsing, and static files.",
                "Gained experience in designing models and establishing database connections using Sequelize.",
                "Defined validations and handled associations.",
                "Implemented error handling and validation to ensure a robust application.",
                "Enhanced understanding of RESTful APIs, asynchronous programming, and dynamic content rendering.",
                "Prepared for building complex web applications."
            ],
            "technologies": [
                "JavaScript",
                "React",
                "HTML",
                "CSS",
                "JSON",
                "API",
                "SQL",
                "Node",
                "Express"
            ],
            "live_link": "https://project8-sqllibrarymanager-production.up.railway.app/books",
            "github_link": "https://github.com/Erin-Ramos/Project8-SQLLibraryManager",
            "image_urls": [
                "/static/images/6-0.png",
                "/static/images/6-1.png",
                "/static/images/6-2.png"
            ]
        },
        {
            "id": 2,
            "project_name": "React Gallery App",
            "description": "A searchable photo gallery application using React.",
            "info": [
                "Strengthened skills in modern web development, particularly in using React for building interactive user interfaces.",
                "Learned to manage state with useState and control side effects with useEffect to fetch and display data dynamically based on user input and navigation changes.",
                "Gained experience with React Router for client-side routing, allowing users to navigate between different views seamlessly.",
                "Implemented Axios for handling API requests, creating a responsive photo gallery that updates based on search queries.",
                "Enhanced understanding of component-based architecture, event handling, and conditional rendering in React."
            ],
            "technologies": [
                "JavaScript",
                "React",
                "HTML",
                "CSS",
                "JSON",
                "API"
            ],
            "github_link": "https://github.com/Erin-Ramos/Project7-ReactGallery",
            "image_urls": [
                "/static/images/5-0.png",
                "/static/images/5-1.png",
                "/static/images/5-2.png"
            ]
        },
        {
            "id": 3,
            "project_name": "OOP Game Show",
            "description": "Hangman like game with 5 lives and 5 random phrases. Guess the phrase before you run out of lives!",
            "info": [
                "Developed and refined skills in object-oriented programming (OOP) using JavaScript.",
                "Learned to structure code by creating classes such as Game and Phrase.",
                "Encapsulated related properties and methods within these classes to manage game logic and phrase handling.",
                "Gained experience in event handling by setting up interactions for button clicks and key presses, ensuring a responsive and interactive user interface.",
                "Implemented DOM manipulation to dynamically update the game state, display phrases, manage user input, and provide feedback on game progress.",
                "Enhanced debugging skills and understanding of state management within a complex application."
            ],
            "technologies": [
                "JavaScript",
                "HTML",
                "CSS",
                "Object-Oriented Programming"
            ],
            "live_link": "https://erin-ramos.github.io/Project4-OOPGameShow/",
            "github_link": "https://github.com/Erin-Ramos/Project4-OOPGameShow",
            "image_urls": [
                "/static/images/3-0.png",
                "/static/images/3-1.png"
            ]
        },
        {
            "id": 4,
            "project_name": "Interactive Form",
            "description": "Registration form allowing the user to choose their job role, t-shirt style and size, sign up for courses, and submit payment.",
            "info": [
                "Enhanced JavaScript skills in DOM manipulation, event handling, and form validation.",
                "Learned to dynamically update form elements based on user input.",
                "Implemented features to show or hide job role fields and T-shirt color options.",
                "Added accessibility features to improve user experience and ensure clear focus states.",
                "Managed real-time updates to the total cost of selected activities.",
                "Provided feedback on form validation to ensure all necessary information is correctly filled out before submission.",
                "Strengthened ability to create interactive and user-friendly forms, crucial for modern web development."
            ],
            "technologies": [
                "JavaScript",
                "HTML",
                "CSS"
            ],
            "live_link": "https://erin-ramos.github.io/Project3-InteractiveForm/",
            "github_link": "https://github.com/Erin-Ramos/Project3-InteractiveForm",
            "image_urls": [
                "/static/images/2-0.png",
                "/static/images/2-1.png",
                "/static/images/2-2.png"
            ]
        },
        {
            "id": 5,
            "project_name": "Data Pagination and Filtering",
            "description": "An interactive webpage that allows the user to easily navigate through pages of students and dynamically search for a specific student.",
            "info": [
                "Learned to manipulate the DOM to display a paginated list of items dynamically.",
                "Ensured a clean and user-friendly interface.",
                "Became proficient in creating and managing pagination controls for smooth data navigation.",
                "Developed search functionality to filter and display results based on user input.",
                "Enhanced the interactivity and usability of the webpage.",
                "Strengthened ability to work with event listeners.",
                "Utilized HTML template literals and conditional logic."
            ],
            "technologies": [
                "JavaScript",
                "HTML",
                "CSS"
            ],
            "live_link": "https://erin-ramos.github.io/Project2-DataPagination/",
            "github_link": "https://github.com/Erin-Ramos/Project2-DataPagination",
            "image_urls": [
                "/static/images/1-0.png",
                "/static/images/1-1.png",
                "/static/images/1-2.png"
            ]
        },
        {
            "id": 6,
            "project_name": "Random Quote Generator",
            "description": "Provides the user with a randomly selected quote and background color each time they click a button.",
            "info": [
                "Honed JavaScript programming skills, including array manipulation, randomization, functions, string interpolation, and conditional statements.",
                "Integrated HTML and CSS through DOM manipulation, dynamically changing webpage elements.",
                "Gained experience in event handling.",
                "Learned to use time-based functions like setInterval()."
            ],
            "technologies": [
                "JavaScript",
                "HTML",
                "CSS"
            ],
            "live_link": "https://erin-ramos.github.io/Project1-RandomQuoteGenerator/",
            "github_link": "https://github.com/Erin-Ramos/Project1-RandomQuoteGenerator",
            "image_urls": [
                "/static/images/0-0.png",
                "/static/images/0-1.png"
            ]
        }
    ]
}
